"""
Just text constants
"""

start_text = 'Welcome!'

create_text = ['',
               'Отличное имя! Теперь, введите описание вашего курса, которе будет видно всем пользователям в каталоге ',
               'Теперь, введите дополнительную информацию о курсе для только что подписавшегося пользователя,'
               ' которую он сможет получить, нажав на кнопку \'Подробнее\'',
               'Теперь, давайте создадим приветственное сообщение,'
               'которое будет встречать только что подписавшегося пользователя. Текст можно ввести ниже!',
               "Теперь давайте создадим заключительное сообение, которое подведет черту под всем вашим курсом.",
               'Теперь, давайте решим, будет ли ваш курс платным?']
'''
 name=[1, 'description'],
    description=[2, 'more'],
    more=[3, 'start_message'],
    start_message=[4, 'finish_message'],
    finish_message=[5, 'more', True]

'''

creation_text = 'Вы в меню создания курса! ' \
                'Впереди - цепочка из вопросов, которые помогут вам донести до пользователей нужную информацию. ' \
                'Начнем с того, что назовем ваш курс. \n' \
                'Введите название ниже!'

lessons_texts = ['', 'Прикрепить ссылку?', 'Прикрепить кнопку \"Подробнее\"', 'Отлично! Прикрепить фотографию к уроку?', 'Хорошо! Прикрепить документ к уроку?']

menu_text = "Выберите одну из кнопок ниже чтобы попасть в соответствующее меню." \
            "\n\n\t- Мои подписки📜 - просмотр и редактирование действующих подписок на курсы" \
            "\n\n\t- Новая подписка🔥 - просмотр каталога курсов" \
            "\n\n\t- Контакты👓 - узнать наши контакты, сообщить об ошибке, написать пожелания и предложения"

help_text = "Немного команд, которые помогут вам разобраться!\n\n" \
            "\t\t/start - Запуск бота\n\n" \
            "\t\t/menu - Показать главное меню\n\n" \
            "\t\t/create - Создать новый курс\n\n" \
            "\t\t/copyright - Показать авторские права\n\n" \
            "\t\t/stop - Остановить бота \n\n" \
            "\t\t/help - Помощь \n\n" \
            "\t\t/link - Ссылка на бота\n\n"

stop_text = 'Надеемся, наш бот принес вам пользу!'

